app/controllers/expansions_controller.rb

SELECT * FROM "expansions"
---
  def index
    @expansions = Expansion.all

SELECT * FROM "expansions" WHERE ("expansions"."id" = 1)
---
  def show
    @expansion = Expansion.find(params[:id])

INSERT INTO "expansions" ("name", "created_at", "updated_at") VALUES('The Wrath of the Lich King', '2009-05-30 23:08:20', '2009-05-30 23:08:20')
---
  def create
    @expansion = Expansion.new(params[:expansion])

    respond_to do |format|
      if @expansion.save