app/controllers/factions_controller.rb

SELECT * FROM "factions"
---
  def index
    @factions = Faction.all

SELECT * FROM "factions" WHERE ("factions"."id" = 1)
---
  def show
    @faction = Faction.find(params[:id])

INSERT INTO "factions" ("name", "created_at", "updated_at") VALUES('Horde', '2009-10-22 18:50:10', '2009-10-22 18:50:10')
---
  def create
    @faction = Faction.new(params[:faction])

    respond_to do |format|
      if @faction.save