app/controllers/instance_names_controller.rb

SELECT * FROM "instance_names"
---
  def index
    @instance_names = InstanceName.all

SELECT * FROM "instance_names" WHERE ("instance_names"."id" = 1)
---
  def show
    @instance_name = InstanceName.find(params[:id])

SELECT * FROM "instance_names" WHERE ("instance_names"."id" = 1)
---
  def edit
    @instance_name = InstanceName.find(params[:id])

INSERT INTO "instance_names" ("name", "created_at", "updated_at") VALUES('Ulduar', '2009-05-30 22:47:35', '2009-05-30 22:47:35')
---
  def create
    @instance_name = InstanceName.new(params[:instance_name])

    respond_to do |format|
      if @instance_name.save