app/controllers/raids_controller.rb

SELECT * FROM "raids"
---
  def index
    @raids = Raid.all

SELECT * FROM "raids" WHERE ("raids"."id" = 1)
---
  def show
    @raid = Raid.find(params[:id])

SELECT * FROM "raids" WHERE ("raids"."id" = 1)
---
  def edit
    @raid = Raid.find(params[:id])

INSERT INTO "raids" ("heals", "realm_id", "updated_at", "code", "searchable", "tanks", "creator_id", "instance_id", "min_gear_level", "raid_time", "raid_end_time", "protected", "dps", "password", "created_at") VALUES(NULL, NULL, '2010-03-08 03:50:47', 'My raid', 'f', NULL, 1, 1, NULL, '2010-03-24 22:50:00', '2015-03-08 03:38:00', 'f', NULL, '', '2010-03-08 03:50:47')
---
  def create
    @raid = Raid.new(params[:raid])

    respond_to do |format|
      if @raid.save